{
  "backend/main.mo": "Main Motoko actor for the portfolio backend, implementing blob storage, access control (admin/user roles), user profile management, and public query functions returning project data including titles, videos, and details.",
  "feature_evidence.json": "Feature evidence report documenting four confirmed title-update changes: renaming roles in the Projects and Resume sections from 'Lead Unreal Engine Developer'/'Unreal Developer' to 'Lead Technical Designer'/'Technical Designer'.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries, serving as a reference document describing the purpose and key details of each frontend component, hook, and page.",
  "frontend/index.html": "Root HTML entry point for the React app, setting the page title to 'Game Design Portfolio Website' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Main application component that composes the full portfolio layout (Header, Hero, Projects, About, Resume, Contact, Footer) with dark theme forced via next-themes; the Skills section is commented out but preserved.",
  "frontend/src/components/About.tsx": "About section displaying a profile photo, a three-paragraph professional bio for Boyan (6 years experience), and a four-card skills grid covering Technical Design, Game Engines, Systems Design, and Cross-Functional Leadership.",
  "frontend/src/components/Contact.tsx": "Contact section rendering email, location (Valencia, Spain), and LinkedIn in a single horizontal row with icon buttons and hover effects on a dark background.",
  "frontend/src/components/Footer.tsx": "Minimal footer displaying a copyright line with a heart icon and a link to caffeine.ai as the build tool.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with centered desktop nav links (Home, Projects, About, Resume, Contact) supporting smooth-scroll, and a slide-out Sheet menu for mobile viewports.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a YouTube video background, animated cycling subtitles, scroll-based parallax/fade effects, and buttons to navigate to other sections.",
  "frontend/src/components/Projects.tsx": "Projects showcase section that renders a list of project cards with a modal detail view, embedding YouTube videos and linking to external URLs like ArtStation.",
  "frontend/src/components/Resume.tsx": "Resume section displaying work experience, education, and certifications as styled card lists with static hardcoded data.",
  "frontend/src/components/Skills.tsx": "Skills section that fetches skill names from the backend via a query hook and renders them in a responsive grid with mapped icons and descriptions, including a loading skeleton state.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data (projects, skills, user profile, admin status) using the actor from useActor.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines light/dark theme CSS custom properties (colors, radius, sidebar, charts) using OKLCH color space, plus utility animation classes (fade-in, slide-in).",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider (React Query) and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPage.tsx": "Empty file with no content; placeholder for an AdminPage component.",
  "frontend/src/pages/ProjectDetail.tsx": "Empty file with no content; placeholder for a ProjectDetail page component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens, extends spacing/font sizes, and registers typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking four completed features that update job titles from 'Unreal Engine Developer' variants to 'Technical Designer' variants across the Projects and Resume sections of a portfolio site.",
  "unknown.txt": "Empty file with no content."
}